#[test]

/*
{
    let x = 5;            // ----------+-- 'b
                          //           |
    let r = &x;           // --+-- 'a  |
                          //   |       |
    println!("r: {}", r); //   |       |
                          // --+       |
}                         // ----------+

*/

//1
/*fn main() {
    let x = 5; // 'b
    {
        let r = &x; // 'a
        println!("r: {}", r); // Виводимо r
    } // 'a завершується, але 'b все ще дійсне

    // Можемо вивести x тут, якщо потрібно
    println!("x: {}", x); // Виводимо x
}*/

//2
fn main() {
    {
        let r; // ---------+-- 'a
        //          |
        { //          |
            let x = 5; // -+-- 'b
            r = &x;    //  |       |
            println!("r: {}", r); //  Виклик в межах блоку
        } // -+       |
    } // ---------+
}




/*
//1
Вивести r за межі блоку

//2
Щоб виправити цю ситуацію, потрібно забезпечити, що x залишається в обсязі,
поки r використовується. Один із способів  це перенести println! всередину блоку, де x визначено
*/